In [ ]:
import pandas as pd

In [ ]:
df=pd.read_csv('HPriceData.csv')

In [ ]:
df.head()

   Area  Bedrooms  Age   Price
0  2600       3.0   20  550000
1  3000       4.0   15  565000
2  3200       NaN   18  610000
3  3600       3.0   30  595000
4  4000       5.0    8  760000

In [ ]:
df=df.fillna(df.median())

In [ ]:
df.head()

   Area  Bedrooms  Age   Price
0  2600       3.0   20  550000
1  3000       4.0   15  565000
2  3200       3.5   18  610000
3  3600       3.0   30  595000
4  4000       5.0    8  760000

In [ ]:
X=df.drop('Price',axis=1)

In [ ]:
X

   Area  Bedrooms  Age
0  2600       3.0   20
1  3000       4.0   15
2  3200       3.5   18
3  3600       3.0   30
4  4000       5.0    8